[
  {"id":"georgeDerivingAccountingStructure2025","author":[{"family":"George","given":"Adam"},{"family":"Pratas","given":"Pedro"},{"family":"Dafermos","given":"Yannis"}],"citation-key":"georgeDerivingAccountingStructure2025","container-title":"Available at SSRN","issued":{"date-parts":[["2025",11,23]]},"title":"Deriving the accounting structure of country-specific SFC models: a step-by-step approach","type":"article-journal","URL":"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5790764"},
  {"id":"thomsenBenchmarkEcologicalStockFlowConsistent2025","abstract":"This paper aims to develop an ecological macroeconomic model for the Danish economy that can link the economic and financial system with some key aspects of the climate. To do so, we combine Stock-flow-Consistent approach (SFC) with Input-Output tables (IO) to build a hybrid model, which we call Ecological Stock-Flow-Consistent Input-Output model (E-SFCIO). Most parameters of the model are estimated using time series data from 1995 to 2019, after which, we carry out simulations. We find that the model (with some minor adjustments) can replicate the dynamics of our key variables pertaining to the economy, financial system, and climate. To further validate the model, we analyse the response of the economy to various shocks, finding that it can capture the stylised facts. The model offers a foundation for providing a reasonable assessment of the climate policies to the relevant stakeholders.","author":[{"family":"Thomsen","given":"Simon Fløj"},{"family":"Raza","given":"Hamid"},{"family":"Byrialsen","given":"Mikael Randrup"}],"citation-key":"thomsenBenchmarkEcologicalStockFlowConsistent2025","container-title":"FMM Working Paper","issued":{"date-parts":[["2025",2]]},"language":"en","source":"Zotero","title":"A Benchmark Ecological Stock-Flow-Consistent Input-Output model for Denmark","type":"article-journal","URL":"https://www.imk-boeckler.de/fpdf/HBS-009060/p_fmm_imk_wp_114_2025.pdf"},
  {"id":"zezzaDesignEmpiricalStockFlowConsistent2019","abstract":"While the literature on theoretical macroeconomic models adopting the stock-flow-consistent (SFC) approach is flourishing, few contributions cover the methodology for building a SFC empirical model for a whole country. Most contributions simply try to feed national accounting data into a theoretical model inspired by Wynne Godley and Marc Lavoie (2007), albeit with different degrees of complexity.","author":[{"family":"Zezza","given":"Gennaro"},{"family":"Zezza","given":"Francesco"}],"citation-key":"zezzaDesignEmpiricalStockFlowConsistent2019","container-title":"Levy Economics Institute Working Paper Collection","issued":{"date-parts":[["2019",1]]},"language":"en","source":"Zotero","title":"On the Design of Empirical Stock-Flow-Consistent Models","type":"article-journal","URL":"https://www.levyinstitute.org/wp-content/uploads/2024/02/wp_919.pdf"}
]
